rails-backend/app/controllers/users_controller.rb

  def create
    @user = User.create!(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "phone_number", "email", "address_1", "postal_code", "city", "state", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "phone_number" = $3, "email" = $4, "address_1" = $5, "postal_code" = $6, "city" = $7, "state" = $8, "country" = $9, "updated_at" = $10 WHERE "users"."id" = $11